import libraries

In [1]:
import pandas as pd

In [7]:
# Example dataset
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['John', 'Anna', 'Peter']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]})
df3 = pd.DataFrame({'ID_column': [2, 3, 4], 'Score': [85, 90, 95]})

Merge

In [ ]:
pd.merge(df1, df2, on="ID", how="outer")

   ID   Name  Score
0   1   John    NaN
1   2   Anna   85.0
2   3  Peter   90.0
3   4    NaN   95.0

In [19]:
pd.merge(df1, df3, left_on="ID", right_on="ID_column", how="outer")

    ID   Name  ID_column  Score
0  1.0   John        NaN    NaN
1  2.0   Anna        2.0   85.0
2  3.0  Peter        3.0   90.0
3  NaN    NaN        4.0   95.0

In [16]:
pd.merge(df1, df2, on="ID", how="inner")

   ID   Name  Score
0   2   Anna     85
1   3  Peter     90

In [18]:
pd.merge(df1, df3, left_on="ID", right_on="ID_column", how="outer")

    ID   Name  ID_column  Score
0  1.0   John        NaN    NaN
1  2.0   Anna        2.0   85.0
2  3.0  Peter        3.0   90.0
3  NaN    NaN        4.0   95.0

In [5]:
pd.merge(df1, df2, on="ID", how="outer")

   ID   Name  Score
0   1   John    NaN
1   2   Anna   85.0
2   3  Peter   90.0
3   4    NaN   95.0

JOIN

In [21]:
df1.join(df2, on="ID", lsuffix="left", rsuffix="right", how="inner")

   ID  IDleft  Name  IDright  Score
0   1       1  John        3     90
1   2       2  Anna        4     95

In [24]:
df1_index = df1.set_index("ID")
df2_index = df2.set_index("ID")

In [25]:
df1_index.join(df2_index, how="outer")

     Name  Score
ID
1    John    NaN
2    Anna   85.0
3   Peter   90.0
4     NaN   95.0

Concat

In [26]:
pd.concat([df1, df2], axis=0, ignore_index=True)

   ID   Name  Score
0   1   John    NaN
1   2   Anna    NaN
2   3  Peter    NaN
3   2    NaN   85.0
4   3    NaN   90.0
5   4    NaN   95.0

In [27]:
pd.concat([df1, df2], axis=1)

   ID   Name  ID  Score
0   1   John   2     85
1   2   Anna   3     90
2   3  Peter   4     95